# caskroom appdir
cask_args appdir: '/Applications'

# caskroom
tap "caskroom/cask"

# zsh
brew "zsh"

# mas
brew "mas"

# browsers
cask "firefox"
cask "google-chrome"
cask "vivaldi"

# video tools
cask "vlc"
cask "handbrake"

# chat apps
cask "whatsapp"
cask "slack"

# utilities
cask "alfred"
cask "bartender"
cask "keepingyouawake"
cask "the-unarchiver"
cask "transmission"
cask "1password"
cask "airserver"
cask "appcleaner"
cask "adobe-acrobat-reader"

# cli utilities
brew "wget"
brew "youtube-dl"
brew "pwgen"

# office365
cask "microsoft-office"

# languages
brew "python"
brew "python3"
cask "java"

# database utilities
cask "sequel-pro"
cask "robomongo"

# rest clients
cask "cocoarestclient"
cask "postman"

# text editors
cask "sublime-text"

# Docker
cask "docker"
cask "kitematic"
cask "dockstation"

# File client
cask "transmit"

# Build tools
brew "carthage"

# mas apps
mas "Bear", id: 1091189122
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Microsoft Remote Desktop", id: 715768417
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Parcel", id: 639968404
mas "Xcode", id: 497799835
