# Repos
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/cask-fonts"
tap "homebrew/services"

# zsh
brew "zsh"

# mas
brew "mas"

# browsers
cask "firefox"
cask "google-chrome"
cask "vivaldi"

# video tools
cask "iina"
cask "handbrake"
cask "vlc"

# chat apps
cask "whatsapp"
cask "slack"

# utilities
cask "alfred"
cask "bartender"
cask "keepingyouawake"
cask "the-unarchiver"
cask "transmission"
cask "1password"
cask "airserver"
cask "appcleaner"
cask "adobe-acrobat-reader"
cask "tunnelblick"
cask "spectacle"
cask "tomighty"
cask "itsycal"
cask "fanny"

# cli utilities
brew "wget"
brew "svgo"
brew "youtube-dl"
brew "pwgen"
brew "imagemagick"
brew "tig"
brew "jq"
brew "tmux"

# office365
cask "microsoft-office"

# languages
brew "node"
brew "python3"
brew "erlang"
brew "elixir"
cask "java"

# database utilities
cask "sequel-pro"
cask "robo-3t"

# rest clients
cask "cocoarestclient"
cask "postman"

# Disk Creators
cask "install-disk-creator"
cask "etcher"

# text editors
cask "sublime-text"

# Docker
cask "docker"
cask "kitematic"
cask "dockstation"

# File client
cask "caskroom/versions/transmit4"

# Build tools
brew "carthage"

# Fonts
cask "caskroom/fonts/font-menlo-for-powerline"
cask "caskroom/fonts/font-raleway"

# Services
brew "postgresql", restart_service: true

# Games
cask "openttd"
cask "0-ad"

# mas apps
mas "Bear", id: 1091189122
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Microsoft Remote Desktop", id: 1295203466
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Parcel", id: 639968404
mas "Xcode", id: 497799835
